1. Attendance Data

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.



2. Read the coffee_levels table.
Transform the data so that each carafe is in it's own column.

Is this the best shape for the data?

Cake Recipes

3. Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
Tidy the data as necessary.

Which recipe, on average, is the best?

Which oven temperature, on average, produces the best results?

Which combination of recipe, rack position, and temperature gives the best result?

## 1. Attendance Data Set

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

In [20]:
df=pd.read_csv('attendance.csv')

In [21]:
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [23]:
df = df.rename(columns={'Unnamed: 0': 'name'})
df= df.melt(id_vars='name', 
                  var_name='date',
                  value_name='attend')

In [24]:
df.head()

    name        date attend
0  Sally  2018-01-01      P
1   Jane  2018-01-01      A
2  Billy  2018-01-01      A
3   John  2018-01-01      P
4  Sally  2018-01-02      T

In [25]:
df.attend = df.attend.map({'P':1, 'A':0, 'H':.5, 'T':.9})
df.groupby('name').mean()

       attend
name
Billy  0.5250
Jane   0.6875
John   0.9125
Sally  0.7625

## 2. Coffee data set

In [34]:
df2 = pd.read_csv('https://gist.githubusercontent.com/o0amandagomez0o/f6ea956fedae90420fd2ce4bd382ea8a/raw/coffee_levels.csv')
df2.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [35]:
df2.pivot(index='hour',
            columns='coffee_carafe',
            values='coffee_amount')

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

## 3. Cake Recipe

In [39]:
df3 = pd.read_csv("https://gist.githubusercontent.com/o0amandagomez0o/6bb870ddd6cae613999b9cf33ac41c33/raw/cake_recipes.csv")

In [40]:
df3 = df3.melt(id_vars='recipe:position', var_name='temp', value_name='score')

In [42]:
df3.head()

  recipe:position temp      score
0        a:bottom  225  61.738655
1           a:top  225  51.709751
2        b:bottom  225  57.095320
3           b:top  225  82.455004
4        c:bottom  225  96.470207

In [44]:
df3[['recipe','position']] = df3['recipe:position'].str.split(':', expand=True)
df3 = df3.drop(columns='recipe:position')

In [48]:
df3.groupby('recipe').mean(), df3.groupby('recipe').mean().idxmax()

(            score
 recipe
 a       63.922201
 b       76.736074
 c       75.874748
 d       62.864844,
 score    b
 dtype: object)

In [49]:
df3.groupby('recipe').mean().max()

score    76.736074
dtype: float64

In [50]:
df3.groupby('temp').mean()

          score
temp
225   71.306022
250   66.577437
275   74.886754
300   66.627655

In [51]:
df3.groupby('temp').mean().sort_values('score').tail(1)

          score
temp
275   74.886754

In [52]:
df3.groupby(['recipe','position','temp']).mean().sort_values('score').tail(1)

                          score
recipe position temp
b      bottom   300   99.248541